InformationRegisters/ОбновленияОбъектовИзВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОбновленияОбъектовИзВнешнихСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбновленияОбъектовИзВнешнихСистем/Ext/ManagerModule.bsl
Процедура ЗарегистрироватьДатуОбновления(Объект, ВнешняяСистема, Примечание = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ОбновленияОбъектовИзВнешнихСистем.СоздатьМенеджерЗаписи();
	Запись.Объект         = Объект;
	Запись.ВнешняяСистема = ВнешняяСистема;
	Запись.Примечание     = Примечание;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ЗарегистрироватьДатуОбновления

Функция ПолучитьДатуОбновления(Объект, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбновленияОбъектовИзВнешнихСистем.ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	РегистрСведений.ОбновленияОбъектовИзВнешнихСистем КАК ОбновленияОбъектовИзВнешнихСистем
		|ГДЕ
		|	ОбновленияОбъектовИзВнешнихСистем.Объект = &Объект
		|	И ОбновленияОбъектовИзВнешнихСистем.ВнешняяСистема = &ВнешняяСистема";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаОбновления;
	Иначе
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
КонецФункции // ПолучитьДатуОбновления
